'''a = (54-11)/2
print(a)
print('Hello world!')

test1 = 'Первая часть'
test2 = ' Вторая часть'
result = test1 + ' и' + test2
print(result)

name = 'Sergey'
test5 = 'Hello ' + name + '. Good day.'
print(test5)
test3 = f'Hello {name}. Good day!'
print(test3)
test4 = 'Hello {name}. Good day!!'.format(name=name)
print(test4)'''

'''a = int(input('Введите первое число ')) #int - преобразует в число.
b = int(input('Введите второе число '))
с = int(input('Введите третье число '))
print((a+b+с)/3)'''

'''print(type(3.5))
print(isinstance('3', str))
print(isinstance('3', int))'''


'''name = (input('Введите Фамилию Имя Отчество '))
address = (input('Введите адрес '))
text1 = 'Здравствуйте, '
text2 = '. Ваш заказ отправлен по адресу '
print(text1+name.title()+text2+address.title())'''


'''Запросите у пользователя ФИО и адрес. 
Выведите на экран сообщения вида:“Здравствуйте, (ФИО). Ваш заказ отправлен по адресу (адрес)“ с полученными данными.
Фамилия, имя, отчество и адрес должны начинаться с заглавных букв вне зависимости от того как их ввел пользователь. 
'''

'''print (text[1:19:2])'''


'''password = 'key'
a = (input('Введите пароль'))
if a == password:
    print('пароль верный')
else:
    print('пароль не верный')
'''

a = int(input('Введите число'))

if a%2 == 0:
    print('число чётное')
else:
    print('число не чётное')


